#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ALX-Terraform-Labs/demo-giithub-actions/runs/run-vzWpz7aFZ62QxMgs

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=ideal-hog]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0977ea85f9f5d007c]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-08dd49d6eb17e0547]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-088e4371aa68f0cae]
aws_security_group.web-sg: Refreshing state... [id=sg-08a613e1deb39c40d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0febae8fe45f7135e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fef6a84f9c977bc3]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de5aaac0e7567aa3]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01bccfb27a67d6179]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-043c5bd5dc088c17f]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ec1a6aad005f0de6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c7b69b241dff9c85]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0cc9a7aa4cf284b24]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0757f6dd10bbe4865]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0c2c3325fc4127df6]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c1f983ff0cb4999d]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03e99b63895be76d2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08a9b229118a8db54]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-070277783dc500e5a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0cc9a7aa4cf284b241080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ec1a6aad005f0de61080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0febae8fe45f7135e1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_security_group.web-sg has been deleted
  - resource "aws_security_group" "web-sg" {
      - arn                    = "arn:aws:ec2:us-west-2:645307551852:security-group/sg-08a613e1deb39c40d" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-08a613e1deb39c40d" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "ideal-hog-sg" -> null
      - owner_id               = "645307551852" -> null
      - revoke_rules_on_delete = false -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_eip.nat[0] has been deleted
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-088e4371aa68f0cae" -> null
      - association_id       = "eipassoc-073fa29e6655b219a" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-088e4371aa68f0cae" -> null
      - network_border_group = "us-west-2" -> null
      - network_interface    = "eni-0792ac7d9548fc64f" -> null
      - private_dns          = "ip-10-0-101-8.us-west-2.compute.internal" -> null
      - private_ip           = "10.0.101.8" -> null
      - public_dns           = "ec2-54-213-88-85.us-west-2.compute.amazonaws.com" -> null
      - public_ip            = "54.213.88.85" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[1] has been deleted
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-08dd49d6eb17e0547" -> null
      - association_id       = "eipassoc-0c0f54af580ef619d" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-08dd49d6eb17e0547" -> null
      - network_border_group = "us-west-2" -> null
      - network_interface    = "eni-048cd3a767e6b5a60" -> null
      - private_dns          = "ip-10-0-102-109.us-west-2.compute.internal" -> null
      - private_ip           = "10.0.102.109" -> null
      - public_dns           = "ec2-52-33-71-203.us-west-2.compute.amazonaws.com" -> null
      - public_ip            = "52.33.71.203" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-west-2:645307551852:internet-gateway/igw-01bccfb27a67d6179" -> null
      - id       = "igw-01bccfb27a67d6179" -> null
      - owner_id = "645307551852" -> null
      - tags     = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc"
          - "Terraform"   = "true"
        } -> null
      - vpc_id   = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_nat_gateway.this[0] has been deleted
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-088e4371aa68f0cae" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0757f6dd10bbe4865" -> null
      - network_interface_id = "eni-0792ac7d9548fc64f" -> null
      - private_ip           = "10.0.101.8" -> null
      - public_ip            = "54.213.88.85" -> null
      - subnet_id            = "subnet-0fef6a84f9c977bc3" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2a"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[1] has been deleted
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-08dd49d6eb17e0547" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-0c2c3325fc4127df6" -> null
      - network_interface_id = "eni-048cd3a767e6b5a60" -> null
      - private_ip           = "10.0.102.109" -> null
      - public_ip            = "52.33.71.203" -> null
      - subnet_id            = "subnet-0c7b69b241dff9c85" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-us-west-2b"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_route.private_nat_gateway[0] has been deleted
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0febae8fe45f7135e1080289494" -> null
      - nat_gateway_id         = "nat-0757f6dd10bbe4865" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0febae8fe45f7135e" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] has been deleted
  - resource "aws_route" "private_nat_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0ec1a6aad005f0de61080289494" -> null
      - nat_gateway_id         = "nat-0c2c3325fc4127df6" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0ec1a6aad005f0de6" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-01bccfb27a67d6179" -> null
      - id                     = "r-rtb-0cc9a7aa4cf284b241080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0cc9a7aa4cf284b24" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-2:645307551852:route-table/rtb-0febae8fe45f7135e" -> null
      - id               = "rtb-0febae8fe45f7135e" -> null
      - owner_id         = "645307551852" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0757f6dd10bbe4865"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_route_table.private[1] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-2:645307551852:route-table/rtb-0ec1a6aad005f0de6" -> null
      - id               = "rtb-0ec1a6aad005f0de6" -> null
      - owner_id         = "645307551852" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0c2c3325fc4127df6"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_route_table.public[0] has been deleted
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-west-2:645307551852:route-table/rtb-0cc9a7aa4cf284b24" -> null
      - id               = "rtb-0cc9a7aa4cf284b24" -> null
      - owner_id         = "645307551852" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-01bccfb27a67d6179"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_route_table_association.private[0] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-03e99b63895be76d2" -> null
      - route_table_id = "rtb-0febae8fe45f7135e" -> null
      - subnet_id      = "subnet-0de5aaac0e7567aa3" -> null
    }

  # module.vpc.aws_route_table_association.private[1] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0c1f983ff0cb4999d" -> null
      - route_table_id = "rtb-0ec1a6aad005f0de6" -> null
      - subnet_id      = "subnet-043c5bd5dc088c17f" -> null
    }

  # module.vpc.aws_route_table_association.public[0] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-070277783dc500e5a" -> null
      - route_table_id = "rtb-0cc9a7aa4cf284b24" -> null
      - subnet_id      = "subnet-0fef6a84f9c977bc3" -> null
    }

  # module.vpc.aws_route_table_association.public[1] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-08a9b229118a8db54" -> null
      - route_table_id = "rtb-0cc9a7aa4cf284b24" -> null
      - subnet_id      = "subnet-0c7b69b241dff9c85" -> null
    }

  # module.vpc.aws_subnet.private[0] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-2:645307551852:subnet/subnet-0de5aaac0e7567aa3" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0de5aaac0e7567aa3" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "645307551852" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_subnet.private[1] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-2:645307551852:subnet/subnet-043c5bd5dc088c17f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-043c5bd5dc088c17f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "645307551852" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-private-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_subnet.public[0] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-west-2:645307551852:subnet/subnet-0fef6a84f9c977bc3" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2a" -> null
      - availability_zone_id                           = "usw2-az2" -> null
      - cidr_block                                     = "10.0.101.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0fef6a84f9c977bc3" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "645307551852" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public-us-west-2a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_subnet.public[1] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-west-2:645307551852:subnet/subnet-0c7b69b241dff9c85" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-2b" -> null
      - availability_zone_id                           = "usw2-az1" -> null
      - cidr_block                                     = "10.0.102.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0c7b69b241dff9c85" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "645307551852" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc-public-us-west-2b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-0977ea85f9f5d007c" -> null
    }

  # module.vpc.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:us-west-2:645307551852:vpc/vpc-0977ea85f9f5d007c" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-01bff47a2d46456db" -> null
      - default_route_table_id           = "rtb-02a70a7f3e8baaf7d" -> null
      - default_security_group_id        = "sg-0c11e25d34e1a4f15" -> null
      - dhcp_options_id                  = "dopt-06c2fd5b678fce641" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0977ea85f9f5d007c" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-02a70a7f3e8baaf7d" -> null
      - owner_id                         = "645307551852" -> null
      - tags                             = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all                         = {
          - "Environment" = "dev"
          - "Name"        = "example-vpc"
          - "Terraform"   = "true"
        } -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-090bc08d7ae1f3881"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "dece31035f1c0b04df1feac69fbe484b38969f38"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "sg-web"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # random_pet.sg will be destroyed
  # (because random_pet.sg is not in configuration)
  - resource "random_pet" "sg" {
      - id        = "ideal-hog" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2a"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2b"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2b"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc"
          + "Terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2a"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2b"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-us-west-2b"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2a"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2b"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2b"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-public"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-public"
          + "Terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-private-us-west-2b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-public-us-west-2a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-public-us-west-2a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-public-us-west-2b"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc-public-us-west-2b"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc"
          + "Terraform"   = "true"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "example-vpc"
          + "Terraform"   = "true"
        }
    }

Plan: 22 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ vpc_public_subnets = [
      - "subnet-0fef6a84f9c977bc3",
      - "subnet-0c7b69b241dff9c85",
      + (known after apply),
      + (known after apply),
    ]
  + web-address        = (known after apply)

```

</details>

*Pusher: @alexbatistasp, Action: `pull_request`*